RhinoInside.Revit API Documentation
GeometryDecoder.ToPoint2d Method
 Converts the specified UV point to an equivalent Rhino Point2d.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static Point2d ToPoint2d(
	this UV value
)
Parameters
value
Type: UV
A value to convert.
Return Value
Type: Point2d
A Rhino Point2d that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type UV. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace